/**
 *
 * 🔹 Call Stack (стек вызовов)
 * 	сюда попадает весь синхронный код
 * 	выполняется сверху вниз
 * 	если стек занят — ничего больше выполниться не может
 *
 */


/**
 🔹 Heap (куча)
	здесь хранятся объекты, массивы, функции
	к Event Loop напрямую не относится, но важна для понимания
 */


/**
 * 🔹 Web API (или Node API)
 * НЕ JavaScript
 * браузерные возможности:
 * setTimeout
 * fetch
 * DOM events
 * геолокация
 *
 * и т.д.
 *
 *
 * (асинхронное взаимодействие делегируется в WebAPI )
 */


/**
 * 🔸 Callback Queue (macrotask queue)
 *
 * Сюда попадают:
 * setTimeout
 * setInterval
 * DOM events (click, input)
 *
 * старые коллбеки
 */

/**
 * 🔸 Microtask Queue
 *
 * Сюда попадают:
 *
 * Promise.then
 * Promise.catch
 * Promise.finally
 * queueMicrotask
 *
 * ❗ Microtask Queue имеет более высокий приоритет
 */



/**
 * Алгоритм:
 *
 * Event Loop — это бесконечный цикл, который:
 * 1️⃣ Проверяет Call Stack
 * 2️⃣ Если стек пуст — проверяет Microtask Queue
 * 3️⃣ Если микротаски есть — выполняет все
 * 4️⃣ Только потом берёт одну задачу из Callback Queue
 * 5️⃣ Повторяет процесс
 */


// Алгоритм
// Запомнить правило: ❗ Microtask Queue всегда выполняется раньше Callback Queue (Macrotask Queue)


// Todo сделать dz.js