
// Переменные
let name = 1020;

name = 'Joseph';


// Константы

const PORT = 8080;

PORT = 10;


// Нэйминг – именование переменных

const myName = 'Joseph'; //camelCase
const isMarried = true;
const numberOne = 10;


/**
 * 1️⃣ Создай переменную myCountry и присвой ей название страны.
 * 2️⃣ Выведи её в консоль.
 * 3️⃣ Измени название страны и выведи снова.
 * 4️⃣ Создай константу MY_AGE и попробуй изменить её значение.
 * 5️⃣ Найди и исправь ошибку:
 * let user-age = "Ivan";
 */

/**
 * Что такое переменная?
 * Чем let отличается от const?
 * Можно ли изменить значение const?
 * Почему не рекомендуется использовать var?
 * Какие имена переменных считаются хорошими?
 */
